/**
 * Created by kiner on 2016-07-26.
 */
{
    author = "kiner";//作者名称

    authorCh = "汤文辉";//作者别名

    version = "1.0.0";//当前版本

    kinerVersion = [

        "       ❤❤❤     ❤❤❤            ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "       ❤❤❤    ❤❤❤                ❤❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "       ❤❤❤   ❤❤❤                 ❤❤❤"+"",
        "       ❤❤❤  ❤❤❤                  ❤❤❤"+"",
        "       ❤❤❤❤❤❤                    ❤❤❤"+"",
        "       ❤❤❤❤❤                      ❤❤❤"+"",
        "       ❤❤❤❤                        ❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "       ❤❤❤❤                        ❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "       ❤❤❤❤❤                      ❤❤❤"+"",
        "       ❤❤❤ ❤❤❤                   ❤❤❤"+"",
        "       ❤❤❤  ❤❤❤                  ❤❤❤"+"",
        "       ❤❤❤   ❤❤❤                 ❤❤❤"+"",
        "       ❤❤❤    ❤❤❤                ❤❤❤"+"",
        "       ❤❤❤     ❤❤❤            ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "       ❤❤❤       ❤❤❤         ❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"+"",
        "",
        "                  自定义前端开发gulp工作流".blue.bold,
        "",
        "       Version:".green.bold+" "+version.yellow+"                  By:".green.bold+" "+(authorCh+"("+author+")").yellow,
        "",
        ""

    ].join("\n");

    basePath = "./";//根路径

    config = {

        P_TYPE:{
            WARN: "w",
            INFO: "i",
            ERROR: "e",
            LOG: "l"
        }

    };//公共配置



}